Masmiseim36/nxpSDK/devices/MKE14Z7/MKE14Z7.xml
        <register>
          <name>HRS</name>
          <description>Hardware Request Status Register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HRS0</name>
              <description>Hardware Request Status Channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HRS0_0</name>
                  <description>A hardware service request for channel 0 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HRS0_1</name>
                  <description>A hardware service request for channel 0 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS1</name>
              <description>Hardware Request Status Channel 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HRS1_0</name>
                  <description>A hardware service request for channel 1 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HRS1_1</name>
                  <description>A hardware service request for channel 1 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS2</name>
              <description>Hardware Request Status Channel 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HRS2_0</name>
                  <description>A hardware service request for channel 2 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HRS2_1</name>
                  <description>A hardware service request for channel 2 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS3</name>
              <description>Hardware Request Status Channel 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HRS3_0</name>
                  <description>A hardware service request for channel 3 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HRS3_1</name>
                  <description>A hardware service request for channel 3 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS4</name>
              <description>Hardware Request Status Channel 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HRS4_0</name>
                  <description>A hardware service request for channel 4 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HRS4_1</name>
                  <description>A hardware service request for channel 4 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS5</name>
              <description>Hardware Request Status Channel 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HRS5_0</name>
                  <description>A hardware service request for channel 5 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HRS5_1</name>
                  <description>A hardware service request for channel 5 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS6</name>
              <description>Hardware Request Status Channel 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HRS6_0</name>
                  <description>A hardware service request for channel 6 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HRS6_1</name>
                  <description>A hardware service request for channel 6 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRS7</name>
              <description>Hardware Request Status Channel 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HRS7_0</name>
                  <description>A hardware service request for channel 7 is not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HRS7_1</name>
                  <description>A hardware service request for channel 7 is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EARS</name>
          <description>Enable Asynchronous Request in Stop Register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EDREQ_0</name>
              <description>Enable asynchronous DMA request in stop mode for channel 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_0_0</name>
                  <description>Disable asynchronous DMA request for channel 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_0_1</name>
                  <description>Enable asynchronous DMA request for channel 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_1</name>
              <description>Enable asynchronous DMA request in stop mode for channel 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_1_0</name>
                  <description>Disable asynchronous DMA request for channel 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_1_1</name>
                  <description>Enable asynchronous DMA request for channel 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_2</name>
              <description>Enable asynchronous DMA request in stop mode for channel 2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_2_0</name>
                  <description>Disable asynchronous DMA request for channel 2.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_2_1</name>
                  <description>Enable asynchronous DMA request for channel 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_3</name>
              <description>Enable asynchronous DMA request in stop mode for channel 3.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_3_0</name>
                  <description>Disable asynchronous DMA request for channel 3.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_3_1</name>
                  <description>Enable asynchronous DMA request for channel 3.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_4</name>
              <description>Enable asynchronous DMA request in stop mode for channel 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_4_0</name>
                  <description>Disable asynchronous DMA request for channel 4.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_4_1</name>
                  <description>Enable asynchronous DMA request for channel 4.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_5</name>
              <description>Enable asynchronous DMA request in stop mode for channel 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_5_0</name>
                  <description>Disable asynchronous DMA request for channel 5.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_5_1</name>
                  <description>Enable asynchronous DMA request for channel 5.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_6</name>
              <description>Enable asynchronous DMA request in stop mode for channel 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_6_0</name>
                  <description>Disable asynchronous DMA request for channel 6.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_6_1</name>
                  <description>Enable asynchronous DMA request for channel 6.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDREQ_7</name>
              <description>Enable asynchronous DMA request in stop mode for channel 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDREQ_7_0</name>
                  <description>Disable asynchronous DMA request for channel 7.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDREQ_7_1</name>
                  <description>Enable asynchronous DMA request for channel 7.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCHPRI3</name>
          <description>Channel n Priority Register</description>
          <addressOffset>0x100</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CHPRI</name>
              <description>Channel n Arbitration Priority</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPA</name>
              <description>Disable Preempt Ability.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPA_0</name>
                  <description>Channel n can suspend a lower priority channel.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPA_1</name>
                  <description>Channel n cannot suspend any channel, regardless of channel priority.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECP</name>
              <description>Enable Channel Preemption.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECP_0</name>
                  <description>Channel n cannot be suspended by a higher priority channel's service request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECP_1</name>
                  <description>Channel n can be temporarily suspended by the service request of a higher priority channel.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCHPRI2</name>
          <description>Channel n Priority Register</description>
          <addressOffset>0x101</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CHPRI</name>
              <description>Channel n Arbitration Priority</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPA</name>
              <description>Disable Preempt Ability.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPA_0</name>
                  <description>Channel n can suspend a lower priority channel.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPA_1</name>
                  <description>Channel n cannot suspend any channel, regardless of channel priority.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECP</name>
              <description>Enable Channel Preemption.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECP_0</name>
                  <description>Channel n cannot be suspended by a higher priority channel's service request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECP_1</name>
                  <description>Channel n can be temporarily suspended by the service request of a higher priority channel.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCHPRI1</name>
          <description>Channel n Priority Register</description>
          <addressOffset>0x102</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CHPRI</name>
              <description>Channel n Arbitration Priority</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPA</name>
              <description>Disable Preempt Ability.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPA_0</name>
                  <description>Channel n can suspend a lower priority channel.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPA_1</name>
                  <description>Channel n cannot suspend any channel, regardless of channel priority.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECP</name>
              <description>Enable Channel Preemption.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECP_0</name>
                  <description>Channel n cannot be suspended by a higher priority channel's service request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECP_1</name>
                  <description>Channel n can be temporarily suspended by the service request of a higher priority channel.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCHPRI0</name>
          <description>Channel n Priority Register</description>
          <addressOffset>0x103</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CHPRI</name>
              <description>Channel n Arbitration Priority</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPA</name>
              <description>Disable Preempt Ability.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPA_0</name>
                  <description>Channel n can suspend a lower priority channel.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPA_1</name>
                  <description>Channel n cannot suspend any channel, regardless of channel priority.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECP</name>
              <description>Enable Channel Preemption.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECP_0</name>
                  <description>Channel n cannot be suspended by a higher priority channel's service request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECP_1</name>
                  <description>Channel n can be temporarily suspended by the service request of a higher priority channel.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
